app/controllers/users_controller.rb

    def create
        @user = User.new(:username => params[:username], :email => params[:email], :password => params[:password])
        @user = User.new(user_params)
          if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "emma"], ["email", "emmanuellekamwa@gmail.com"], ["password", "alix2711"], ["created_at", "2021-02-04 14:47:44.912733"], ["updated_at", "2021-02-04 14:47:44.912733"]]